import PrimeGuideCore

// swiftlint:disable line_length
struct Text: TextProtocol {
    let about = """
    White Rabbit Family – российский ресторанный альянс, основанный Борисом Зарьковым в 2010 году.

    В него входят 13 проектов в Москве, 1 – в Плесе, 7 – в Сочи и 1 – в Бодруме. Рестораны WRF отмечены престижными российскими и международными рейтингами, а авторитетные европейские гиды рекомендуют их иностранным туристам.

    Основатель White Rabbit Family – Борис Зарьков.

    В 2016 году стал лауреатом национальной премии «Гостеприимство» за вклад в развитие индустрии гостеприимства;
    «Ресторатор года» по версии премии «Человек года-2016» журнала GQ;
    «Лучший ресторатор года» по версии «Ресторанного рейтинга» журнала GQ в 2017;
    «Лучший ресторатор Сочи-2017»;
    «Лучший ресторатор года» по версии ресторанного рейтинга журнала GQ в 2018;
    В 2021 – лауреат премии «Cosmopolitan Man Awards».

    Бренд-шеф и партнер White Rabbit Family – Владимир Мухин – один из самых выдающихся российских шефов. Занимает 9 место в мировом рейтинге «The 300 Best World Chefs»
    """

    let aboutTitle = "О White Rabbit Family"

    let service = """
    Удобный доступ к ресторанам White Rabbit Family — на платформе открыто бронирование столов и банкетов, доставка готовых блюд, информация о специальных предложениях и новинках, акции и бонусы в одном приложении.

    Приложение даёт возможность участвовать в новой программе лояльности ресторанной группы – Гости накапливают баллы и оплачивают с их помощью свои последующие заказы.

    В приложении можно легко найти рестораны на карте, выбрать удобные временные слоты для бронирования стола, посмотреть актуальное меню и афишу мероприятий White Rabbit Family.
    """

    let shareText = "Удобный доступ к ресторанам White Rabbit Family"

    let onboardingNotificationStep = "Напомним о брони, статусе заказа при доставке еды, расскажем о событиях и специальных предложениях"

    let onboardingGeolocationStep = "Предложим рестораны рядом, подскажем, куда лучше сходить и где заказать еду на дом"

    let onboardingSignInStep = "Получите персональную скидку до 50% в наших ресторанах после авторизации"
}
