import PrimeGuideCore

// TODO: Replace with production values

struct MDText: TextProtocol {
    let about = """
    Maison Dellos – это особый стиль жизни, который выбирают люди, стремящиеся к красоте и гармонии, те, для кого важны детали, и не существует мелочей!
    Ключевым направлением деятельности компании Maison Dellos является ресторанный бизнес.
    
    Восемь ресторанов высокой кухни и кондитерская: «Кафе Пушкинъ» и «Кафе Пушкинъ у фонтана» в ГУМе, «Турандот», «Шануар», «Матрёшка», «Казбек», «Бочка», «Шинок» – по праву стали символами Москвы.
    Два из них – «Кафе Пушкинъ», «Казбек» – рекомендованы к посещению Гидом Michelin Москва 2022
    """
    let aboutTitle = "О Maison Dellos"
    let service = """
    Удобный доступ к ресторанам Maison Dellos — на платформе открыто бронирование столов и банкетов, информация о специальных предложениях и новинках, акции и бонусы в одном приложении.
    
    Приложение даёт возможность участвовать в новой программе лояльности ресторанной группы — Гости накапливают баллы и оплачивают с их помощью свои последующие заказы.
    
    В приложении можно легко найти рестораны на карте, выбрать удобные временные слоты для бронирования стола, посмотреть актуальное меню и афишу мероприятий Maison Dellos.
    """
    let shareText = "Удобный доступ к ресторанам Maison Dellos"
    
    let onboardingNotificationStep = "Напомним о брони, расскажем о\nвечеринках в любимых ресторанах"
    
    let onboardingGeolocationStep = "Покажем рестораны рядом,\nподскажем куда лучше сходить"
    
    let onboardingSignInStep = "Получите персональную скидку\nв наших ресторанах до 10%"
}
