import Foundation

// swiftlint:disable line_length
enum Text {
    static let about = """
    101 — подтвержденный рекомендациями членов клуба PRIME, рестораторами и ресторанными критиками рейтинг лучших ресторанов, баров, ночных клубов и гастрономических проектов в крупнейших городах мира. Включает в себя сезонные тематические подборки, лучшие блюда, особенности кухни и интерьера, отзывы членов клуба PRIME, совокупный рейтинг Michelin, World's 50 Best и Zagat.
    """

    static let aboutTitle = "О 101 Gourmet"

    static let service = """
    101 Gourmet – главная платформа по премиальной доставке еды из самых известных ресторанов и знаковых гастрономических проектов.

    Включает в себя встроенный YouTube-player с live-трансляциями от ведущих поваров страны, кулинарные онлайн-курсы, обзоры и рейтинги знаковых гастрономических проектов и событий.

    •    Лучшие рестораны
    101 - основанный на авторитетном ресторанном рейтинге PRIME 101 сервис по доставке блюд из лучших ресторанов, готовых программ питания от гастрономических стартапов и продуктов избранных гастрономов города.

    •    Программа лояльности
    Привилегии для клиентов компании PRIME, интегрированная программа лояльности для владельцев премиальных карт VISA

    •    Удобство использования
    Детальные фильтры и подборки по ресторанам с различными критериями – по кухням, особенностям меню; быстрая оплата Apple Pay

    •    Технологическая платформа
    101 – единая платформа с возможностью быстрой интеграции с клиентским CRM, адаптирующаяся под White Label-решения для ресторанных холдингов, банков, корпоративных партнеров
    """

    static let shareText = "Сервис премиальной доставки еды"
}
