import PrimeGuideCore

// TODO: Replace with production values

struct FHText: TextProtocol {
    let about = """
    Генеральный управляющий Maison Dellos Александр Зайцев работает в ресторанном бизнесе более 25 лет. Прошел путь от должности заместителя директора ресторана «Шинок» до генерального директора ресторана «Кафе Пушкинъ», в которую вступил в мае 1999 года и покинул в январе 2005, совершив следующий значительный шаг в своей карьере и приняв в управление все рестораны компании Maison Dellos.
    
    За время руководства А. Зайцева компания достигла значительных успехов и вышла на новый, международный, уровень — были открыты рестораны «Турандот», кондитерская «Кафе Пушкинъ», кейтеринговая служба Dellos Catering, объединившая гастрономические и стилистические направления ресторанов А. Деллоса на выездных мероприятиях, две кондитерские и рестораны «Кафе Пушкинъ» в Париже и в Дохе, а также ресторан Betony в Нью-Йорке, получивший звезду Michelin. Четыре московских ресторана Maison Dellos — «Кафе Пушкинъ», «Фаренгейт», «Казбек» и «Волна» — вошли в список рекомендаций гида Michelin Moscow 2022.
    
    Достижениями Александра Зайцева по праву считаются разработка уникальной методики тренинга работников сервиса и непосредственное участие в проектах мирового масштаба: холдинг Maison Dellos выступал организатором питания в Сочи-2014 и на Чемпионате мира по футболу-2018 в Москве, стал официальным гастрономическим партнером мировой выставки Milan Expo и официальным оператором питания FIFA 2022 в Дохе. В 2015 году Александру была присвоена правительственная награда — медаль ордена «За заслуги перед Отечеством» II степени.
    """
    let aboutTitle = "О Maison Dellos"
    let service = """
    Удобный доступ к ресторанам Maison Dellos — на платформе открыто бронирование столов и банкетов, информация о специальных предложениях и новинках, акции и бонусы в одном приложении.
    
    Приложение даёт возможность участвовать в новой программе лояльности ресторанной группы — Гости накапливают баллы и оплачивают с их помощью свои последующие заказы.
    
    В приложении можно легко найти рестораны на карте, выбрать удобные временные слоты для бронирования стола, посмотреть актуальное меню и афишу мероприятий Maison Dellos.
    """
    let shareText = "Удобный доступ к ресторанам Maison Dellos"
    
    let onboardingNotificationStep = "Напомним о брони, расскажем о\nвечеринках в любимых ресторанах"
    
    let onboardingGeolocationStep = "Покажем рестораны рядом,\nподскажем куда лучше сходить"
    
    let onboardingSignInStep = "Получите персональную скидку\nв наших ресторанах до 10%"
}
